# -*- eval: (setq org-download-image-dir (concat default-directory "./static/Python 异常处理/")); -*-
:PROPERTIES:
:ID:       96E04300-DFEB-426D-90E3-B9E79B8A7173
:END:
#+LATEX_CLASS: my-article
#+DATE: <2020-06-30 Tue 02:20>
#+TITLE: Python 异常处理

异常处理在任何一门编程语言里都是值得关注的一个话题，良好的异常处理可以让你的程序更加健壮，清晰的错误信息更能帮助你快速修复问题。
在 Python 中，和部分高级语言一样，使用了 =try/except/finally= 语句块来处理异常，果你有其他编程语言的经验，实践起来并不难。

*** try-finally 语句
~try-finally~ 语句无论是否发生异常都将执行最后的代码.

#+BEGIN_SRC python :results values list :exports no-eval
try:
    <语句>
finally:
    <语句>    # 退出try 时总会执行
raise
#+END_SRC

当在 try 块中抛出一个异常, 立即执行 finally 块代码.
finally 块中的所有语句执行后, 异常被再次触发, 并执行 except 块代码.
参数的内容不同于异常.

下面来看一个实例:

#+BEGIN_SRC python
def div(a, b):
    try:
        print(a / b)
    except ZeroDivisionError:
        print("Error: b should not be 0 !!!")
    except Exception as e:
        print("Unexpected Error: {}".format(e))
    else:
        print('Run into else only when everything goes well.')
    finally:
        print('Always run into finally block.')

# tests
div(2, 0)
div(2, 'bad type')
div(1, 2)
#+END_SRC

#+RESULTS:
: - Error: b should not be 0 !!!
: - Always run into finally block.
: - Unexpected Error: unsupported operand type(s) for /: 'int' and 'str'
: - Always run into finally block.
: - 0
: - Run into else only when everything goes well.
: - Always run into finally block.

#+BEGIN_SRC python :results output list :exports no-eval
# Mutiple  exception in one line
def div(a, b):
    try:
        print(a / b)
    except (ZeroDivisionError, TypeError) as e:
        print(e)

# tests
div(2, 0)
div(2, 'bad type')
#+END_SRC

#+RESULTS:
: - integer division or modulo by zero
: - unsupported operand type(s) for /: 'int' and 'str'

#+BEGIN_SRC python :results values list :exports no-eval
# Except block is optional when there is finally
try:
    open(database)
finally:
    close(database)
#+END_SRC

#+BEGIN_SRC python :results values list :exports no-eval
# catch all errors and log it
try:
    do_work()
except:
    # get detail from logging module
    logging.exception('Exception caught!')
#+END_SRC

#+BEGIN_SRC python :results values list :exports no-eval
# get detail from sys.exc_info() method
error_type, error_value, trace_back = sys.exc_info()
print(error_value)
raise
#+END_SRC

总结如下:
- except 语句不是必须的, finally 语句也不是必须的, 但是二者必须要有一个, 否则就没有 try 的意义了.
- except 语句可以有多个, Python 会按 except 语句的顺序依次匹配你指定的异常, 如果异常已经处理就不会再进入后面的 except 语句.
- except 语句可以以元组形式同时指定多个异常, 参见实例代码.
- except 语句后面如果不指定异常类型, 则默认捕获所有异常, 你可以通过 logging 或者 sys 模块获取当前异常.
- 如果要捕获异常后要重复抛出, 请使用 raise, 后面不要带任何参数或信息.
- 不建议捕获并抛出同一个异常, 请考虑重构你的代码.
- 不建议在不清楚逻辑的情况下捕获所有异常, 有可能你隐藏了很严重的问题.
- 尽量使用内置的异常处理语句来 替换 ~try/except~ 语句, 比如 ~with~ 语句, ~getattr()~ 方法.

** 传递异常 re-raise Exception
捕捉到了异常, 但是又想重新引发它(传递异常), 使用不带参数的 raise 语句即可:

#+BEGIN_SRC python
def f1():
    print(1 / 0)


def f2():
    try:
        f1()
    except Exception as e:
        raise  # don't raise e !!!


f2()
#+END_SRC

#+RESULTS:
: - Traceback (most recent call last):
: -   File "<stdin>", line 12, in <module>
: -   File "<stdin>", line 7, in f2
: -   File "<stdin>", line 2, in f1
: - ZeroDivisionError: integer division or modulo by zero

在 Python 2 中, 为了保持异常的完整信息, 那么你捕获后再次抛出时千万不能在 raise 后面加上异常对象, 否则你的 trace 信息就会从此处截断. 以上是最简单的重新抛出异常的做法.
还有一些技巧可以考虑, 比如抛出异常前对异常的信息进行更新.

#+BEGIN_SRC python
def f1():
    print(1 / 0)


def f2():
    try:
        f1()
    except Exception as e:
        e.args += ('more info', )
    raise

f2()
#+END_SRC

#+RESULTS:
: - Traceback (most recent call last):
: -   File "<stdin>", line 12, in <module>
: -   File "<stdin>", line 7, in f2
: -   File "<stdin>", line 2, in f1
: - ZeroDivisionError: ('integer division or modulo by zero', 'more info')

Python 3 对重复传递异常有所改进, 你可以自己尝试一下, 不过建议还是同上.

